Tekla Open API Reference for Tekla Structures 2025
BoltCatalogStandard.LinkedBoltCatalogSize Property
 The BoltCatalogSize control linked to the BoltCatalogStandard control. Bolt catalog controls always need to be in pairs, meaning in every dialog there has to be a BoltCatalogStandard and a BoltCatalogSize control.
 Namespace: Tekla.Structures.Dialog.UIControls
 Assembly: Tekla.Structures.Dialog (in Tekla.Structures.Dialog.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public BoltCatalogSize LinkedBoltCatalogSize { get; set; }
Public Property LinkedBoltCatalogSize As BoltCatalogSize
	Get
	Set
Property Value
Type: BoltCatalogSize
See Also
Reference
BoltCatalogStandard Class
Tekla.Structures.Dialog.UIControls Namespace